# RailingSystemSecondaryHandrailsLatteralOffset Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RailingSystemSecondaryHandrailsLatteralOffset Property
ParameterTypeId Class See Also
---
"Lateral Offset"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RailingSystemSecondaryHandrailsLatteralOffset { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RailingSystemSecondaryHandrailsLatteralOffset As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RailingSystemSecondaryHandrailsLatteralOffset {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace